#### BuiltInFailures.RevolutionFailures Members

---

|  |
| --- |
| BuiltInFailures RevolutionFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures RevolutionFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CannotDrawRevolution | Can't create surface of revolution. |
| Public property Static member | ProfileCrossesRevolutionAxis | The profile must not cross the axis of revolution. |
| Public property Static member | ProfileNotPlanar | The Profile must lie in a plane. |

# See Also

BuiltInFailures RevolutionFailures Class

Autodesk.Revit.DB Namespace